In [1]:
import pandas as pd

columns = ["marca", "precio", "disponibilidad"]

cocheA = ["Mercedes", 10000, True]
cocheB = ["BMW", 20000, False]

df = pd.DataFrame([cocheA, cocheB], columns=columns)
df

      marca  precio  disponibilidad
0  Mercedes   10000            True
1       BMW   20000           False

In [2]:
import pandas as pd

columns = ["marca", "precio", "disponibilidad"]

marcas = [
    'Audi',
    'Ferrari',
    'Toyota',
    'BMW'
]

precio = [
    100000,
    200000,
    300000,
    400000
]

disponibilidad = [
    True,
    False,
    True,
    True
]

df = pd.DataFrame(
    list(zip(marcas, precio, disponibilidad)),
    columns=columns
)

df

     marca  precio  disponibilidad
0     Audi  100000            True
1  Ferrari  200000           False
2   Toyota  300000            True
3      BMW  400000            True

In [4]:
import pandas as pd

columns = ["marca", "precio", "disponibilidad"]

marcas = [
    'Audi',
    'Ferrari',
    'Toyota',
    'BMW'
]

precio = [
    100000,
    200000,
    300000,
    400000
]

disponibilidad = [
    True,
    False,
    True,
    True
]


diccionario = {
    "marca": marcas,
    "precio": precio,
    "disponibilidad": disponibilidad
}

df = pd.DataFrame(diccionario)
df

     marca  precio  disponibilidad
0     Audi  100000            True
1  Ferrari  200000           False
2   Toyota  300000            True
3      BMW  400000            True

In [4]:
import pandas as pd
 
df = pd.read_excel("datos.xlsx", header=None)
 
print(df)

          0       1               2
0     marca  precio  disponibilidad
1       BMW   10000            True
2  Ferrrari   20000           False
3      Audi   30000            True

In [2]:
import pandas as pd

df = pd.read_csv('datos.csv', delimiter=',') 

df

     marca   precio  disponibilidad
0     Audi   100000            True
1  Ferrari    20000           False
2   Toyota    20000            True

In [5]:
import pandas as pd

tables = pd.read_html('https://en.wikipedia.org/wiki/Python_(programming_language)')

print('Tablas encontradas:', len(tables))
df1 = tables[0]  

print('Primer tabla')
print(df1.head())

Tablas encontradas: 13
Primer tabla
                0                                                  1
0             NaN                                                NaN
1        Paradigm  Multi-paradigm: object-oriented,[1] procedural...
2     Designed by                                   Guido van Rossum
3       Developer                         Python Software Foundation
4  First appeared                  20 February 1991; 31 years ago[2]

In [7]:
import pandas as pd

ruta_archivo_json = 'datos.json'
datos = pd.read_json(ruta_archivo_json, orient='records')

df = pd.DataFrame(datos)
df

      nombre  altura  peso
0       Juan    1.76    65
1       Lina    1.65    68
2  Katherine    1.68    67

In [9]:
import json
import pandas as pd

ruta_archivo_json = 'datos2.json'

with open(ruta_archivo_json) as archivo_json:
    datos_json = json.load(archivo_json)

lista_de_diccionarios = datos_json['datos']
datos = pd.DataFrame(lista_de_diccionarios)
datos

      nombre  altura  peso
0       Juan    1.76    65
1       Lina    1.65    68
2  Katherine    1.68    67

In [ ]:
import pandas as pd
 
df = pd.read_excel("datos.xlsx", header=None)
 
print(df)

In [7]:
import pandas as pd
 
df = pd.read_excel("datos.xlsx", sheet_name=["Hoja1","Hoja2"])
 
print(df["Hoja2"])

      nombre  apellido  edad
0      Diego    Dueñez    19
1     Brayan    Romero    21
2  Francisco  Escobedo    21

In [9]:
import pandas as pd
 
df = pd.read_excel("datos.xlsx", sheet_name=["Hoja2"], usecols=["nombre","edad"])
 
df

{'Hoja2':       nombre  edad
 0      Diego    19
 1     Brayan    21
 2  Francisco    21}